In [1]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.0.1-cp311-cp311-win_amd64.whl (10.6 MB)
     ---------------------------------------- 10.6/10.6 MB 3.3 MB/s eta 0:00:00
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bejay\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1
  Downloading pytz-2023.3-py2.py3-none-any.whl (502 kB)
     -------------------------------------- 502.3/502.3 kB 2.4 MB/s eta 0:00:00
Collecting tzdata>=2022.1
  Using cached tzdata-2023.3-py2.py3-none-any.whl (341 kB)
Requirement already satisfied: numpy>=1.21.0 in c:\users\bejay\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\bejay\appdata\local\programs\python\python311\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.0.1 pytz-2023.3 tzdata-2023.3

[notice] A new release of pip available: 22.3.1 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

# Creating dataframe

In [3]:
#Using dictionary
data={'name':['bijaya','arjun','udaya'],'age':[23,24,24]}
df=pd.DataFrame(data)

In [5]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [6]:
df.columns

Index(['name', 'age'], dtype='object')

In [7]:
df

     name  age
0  bijaya   23
1   arjun   24
2   udaya   24

# Using list of list

In [8]:
data=[['bijaya',30],['Arjun',24],['udaya',24]]
df1=pd.DataFrame(data,columns=['name','age'])

In [9]:
df1

     name  age
0  bijaya   30
1   Arjun   24
2   udaya   24

In [10]:
type(df1)

pandas.core.frame.DataFrame

In [11]:
df.columns

Index(['name', 'age'], dtype='object')

# Accessing Data

In [13]:
df['name']

0    bijaya
1     arjun
2     udaya
Name: name, dtype: object

In [14]:
type(df['name'])

pandas.core.series.Series

In [17]:
df[['name','age']]

     name  age
0  bijaya   23
1   arjun   24
2   udaya   24

In [18]:
df['age']

0    23
1    24
2    24
Name: age, dtype: int64

In [20]:
df['age'][0]

23

In [21]:
#Condition based filtering

In [41]:
df['age']>23

0    False
1     True
2     True
Name: age, dtype: bool

In [42]:
df[df['age']>23]

    name  age
1  arjun   24
2  udaya   24

In [44]:
df[df['name'].str.startswith('a')& (df['age']>23)]

    name  age
1  arjun   24

In [45]:
df['age'].isnull()

0    False
1    False
2    False
Name: age, dtype: bool

In [46]:
df[df['age'].isnull()]

Empty DataFrame
Columns: [name, age]
Index: []

In [51]:
df['age'].isnull().sum()

0

In [52]:
df.loc[0,'name']

'bijaya'

In [54]:
df.loc[0:1,['name','age']]

     name  age
0  bijaya   23
1   arjun   24

In [56]:
df.iloc[0:2,0:2]

     name  age
0  bijaya   23
1   arjun   24

In [59]:
df.at[0,'name'] #used to grab single cell

'bijaya'

In [60]:
df.at[0,'age']

23

In [62]:
df.at[0,'age']

23

In [63]:
df.iat[0,0]

'bijaya'

In [6]:
df=pd.read_csv('data.csv')

In [7]:
df.head(2)

    name   age
0  Alice  25.0
1    Bob  30.0

In [8]:
df.isnull().sum()

name    0
age     0
dtype: int64

In [9]:
df['age'].nunique()

3

In [11]:
df.shape

(3, 2)